function foldToAssci(input){
    var orgin = [
        'à','á','ả','ã','ạ','â','ầ','ấ','ẩ','ẫ','ậ',
        'À','Á','Ả','Ã','Ạ','Â','Ầ','Ấ','Ẩ','Ẫ','Ậ',
        'ằ','ắ','ẳ','ẵ','ặ','ă',
        'Ằ','Ắ','Ẳ','Ẵ','Ặ','Ă',
        'đ', 'Đ',
        'è','é','ẻ','ẽ','ẹ','ê','ề','ế','ể','ễ','ệ',
        'È','É','Ẻ','Ẽ','Ẹ','Ê','Ề','Ế','Ể','Ễ','Ệ',
        'ì','í','ỉ','ị','ĩ',
        'Ì','Í','Ỉ','Ị','Ĩ',
        'ò','ó','ỏ','õ','ọ','ô','ồ','ố','ổ','ỗ','ộ','ơ','ờ','ớ','ở','ỡ','ợ',
        'Ò','Ó','Ỏ','Õ','Ọ','Ô','Ồ','Ố','Ổ','Ỗ','Ộ','Ơ','Ờ','Ớ','Ở','Ỡ','Ợ',
        'ù','ú','ủ','ũ','ụ','ừ','ứ','ử','ữ','ự','ư',
        'Ù','Ú','Ủ','Ũ','Ụ','Ừ','Ứ','Ử','Ữ','Ự','Ư',
        'ỳ','ý','ỷ','ỵ',
        'Ỳ','Ý','Ỷ','Ỵ',
        ';',',','`','?','~','/'
    ];
    var transalte = [
        'a','a','a','a','a','a','a','a','a','a','a',
        'a','a','a','a','a','a','a','a','a','a','a',
        'a','a','a','a','a',
        'a','a','a','a','a',
        'd','d',
        'e','e','e','e','e','e','e','e','e','e','e',
        'e','e','e','e','e','e','e','e','e','e','e',
        'i','i','i','i','i',
        'i','i','i','i','i',
        'o','o','o','o','o','o','o','o','o','o','o','o','o','o','o','o','o',
        'o','o','o','o','o','o','o','o','o','o','o','o','o','o','o','o','o',
        'u','u','u','u','u','u','u','u','u','u','u',
        'u','u','u','u','u','u','u','u','u','u','u',
        'y','y','y','y',
        'y','y','y','y',
        '','','','','',''
    ];
    var output='';
    for(var i=0; i<input.length; i++){
        var char = input[i];
        var index = orgin.indexOf(char);
        if( index >= 0){
            char = transalte[index];
        }else if(char == ' '){
            char = '-';
        }
        output+= char;
    }
    return output;
}